ССЫЛКА НА ИСТОЧНИК ЗАДАЧ: https://www.hackerrank.com/dashboard

<b>Select All</b>

Query all columns (attributes) for every row in the CITY table.

In [ ]:
SELECT *
FROM city;

<b>Revising the Select Query I</b>

Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

In [ ]:
SELECT *
FROM city as c
WHERE c.population > 100000
AND c.countrycode = 'USA';

<b>Revising the Select Query II</b>

Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.

In [ ]:
SELECT c.name
FROM city as c
WHERE c.population > 120000
AND countrycode = 'USA';

<b>Select By ID</b>

Query all columns for a city in CITY with the ID 1661.

In [ ]:
SELECT *
FROM city as c
WHERE c.id = 1661;

<b>Japanese Cities' Attributes</b>

Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT *
FROM city as c
WHERE c.countrycode = 'JPN';

<b>Japanese Cities' Names</b>

Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT c.name
FROM city as c
WHERE c.countrycode = 'JPN';

<b>Weather Observation Station 1</b>

Query a list of CITY and STATE from the STATION table.

In [ ]:
SELECT s.city, s.state
FROM station as s;

<b>Revising Aggregations - The Count Function</b>

Query a count of the number of cities in CITY having a Population larger than 100000

In [ ]:
SELECT COUNT(*)
FROM city as c
WHERE c.population > 100000;

<b>Revising Aggregations - The Sum Function</b>

Query the total population of all cities in CITY where District is California.

In [ ]:
SELECT SUM(c.population)
FROM city as c
WHERE c.district = 'California';

<b>Revising Aggregations - Averages</b>

Query the average population of all cities in CITY where District is California.

In [ ]:
SELECT AVG(c.population)
FROM city as c
WHERE c.district = 'California';

<b>Weather Observation Station 3</b>

Query a list of CITY names from STATION for cities that have an even ID number.<br> Print the results in any order, but exclude duplicates from the answer.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE s.id % 2 = 0;

<b>Weather Observation Station 4</b>

Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

In [ ]:
SELECT COUNT(s.city) - COUNT(DISTINCT(s.city))
FROM station as s;

<b>Weather Observation Station 5</b>

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

In [ ]:
SELECT s.city,
       LENGTH(s.city)
FROM station as s
WHERE LENGTH(s.city) = (SELECT MAX(LENGTH(s.city))
                        FROM station as s);

SELECT s.city,
       LENGTH(s.city)
FROM station as s
WHERE LENGTH(s.city) = (SELECT MIN(LENGTH(s.city))
                        FROM station as s)
ORDER BY 1
LIMIT 1;

<b>Weather Observation Station 6</b>

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT(s.city)
FROM station as s
WHERE LOWER(LEFT(s.city, 1)) IN ('a', 'e', 'i', 'o', 'u');

<b>Weather Observation Station 7</b>

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE RIGHT(s.city, 1) IN ('a', 'e', 'i', 'o', 'u');

<b>Weather Observation Station 8</b>

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE LOWER(LEFT(s.city, 1)) IN ('a', 'e', 'i', 'o', 'u')
AND RIGHT(s.city, 1) IN ('a', 'e', 'i', 'o', 'u');

<b>Weather Observation Station 9</b>

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE LOWER(LEFT(s.city, 1)) NOT IN ('a', 'e', 'i', 'o', 'u');

<b>Weather Observation Station 10</b>

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE RIGHT(s.city, 1) NOT IN ('a', 'e', 'i', 'o', 'u');

<b>Weather Observation Station 11</b>

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels.<br> Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE LOWER(LEFT(s.city, 1)) NOT IN ('a', 'e', 'i', 'o', 'u')
OR RIGHT(s.city, 1) NOT IN ('a', 'e', 'i', 'o', 'u');

<b>Weather Observation Station 12</b>

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. <br>Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT s.city
FROM station as s
WHERE LOWER(LEFT(s.city, 1)) NOT IN ('a', 'e', 'i', 'o', 'u')
AND RIGHT(s.city, 1) NOT IN ('a', 'e', 'i', 'o', 'u');

<b>Higher Than 75 Marks</b>

Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

In [ ]:
SELECT s.name
FROM students as s
WHERE marks > 75
ORDER BY RIGHT(s.name, 3), s.id;

<b>Employee Names</b>

Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

In [ ]:
SELECT e.name
FROM employee as e
ORDER BY e.name;

<b>Employee Salaries</b>

Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than 2000$  per month who have been employees for less than  months. Sort your result by ascending employee_id.

In [ ]:
SELECT e.name
FROM employee as e
WHERE e.salary > 2000
AND e.months < 10
ORDER BY e.employee_id;

<b>Average Population</b>

Query the average population for all cities in CITY, rounded down to the nearest integer.

In [ ]:
SELECT FLOOR(AVG(c.population)) as avg_population
FROM city as c;

<b>Japan Population</b>

Query the sum of the populations for all Japanese cities in CITY. The COUNTRYCODE for Japan is JPN.

In [ ]:
SELECT SUM(c.population) as sum_population
FROM city as c
WHERE c.countrycode = 'JPN';

<b>Population Density Difference</b>

Query the difference between the maximum and minimum populations in CITY.

In [ ]:
SELECT MAX(c.population) - MIN(c.population) as diff_population
FROM city as c;

<b>The Blunder</b>

Samantha was tasked with calculating the average monthly salaries for all employees in the EMPLOYEES table, but did not realize her keyboard's  key was broken until after completing the calculation. She wants your help finding the difference between her miscalculation (using salaries with any zeros removed), and the actual average salary.

Write a query calculating the amount of error (i.e.:  average monthly salaries), and round it up to the next integer.

In [ ]:
SELECT CEILING(AVG(e.salary) - AVG(REPLACE(e.salary, 0, ''))) as diff_miscalculation
FROM employees as e;

<b>Top Earners</b>

We define an employee's total earnings to be their monthly salary * months  worked, and the maximum total earnings to be the maximum total earnings for any employee in the Employee table. Write a query to find the maximum total earnings for all employees as well as the total number of employees who have maximum total earnings. Then print these values as 2 space-separated integers.

In [ ]:
SELECT (e.salary * e.months) as earnings,
       COUNT(*)
FROM employee as e
GROUP BY 1
ORDER BY 1 DESC
LIMIT 1;

<b>Weather Observation Station 2</b>

Query the following two values from the STATION table:

The sum of all values in LAT_N rounded to a scale of 2 decimal places.

The sum of all values in LONG_W rounded to a scale of 2 decimal places.

In [ ]:
SELECT ROUND(SUM(s.lat_n),2),
       ROUND(SUM(s.long_w), 2)
FROM station as s;

<b>Weather Observation Station 13</b>

Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7800 and less than 137.2345 .

Truncate your answer to  decimal places.

In [ ]:
SELECT ROUND(SUM(s.lat_n), 4)
FROM station as s
WHERE s.lat_n BETWEEN 38.7800 AND 137.2345;

<b>Weather Observation Station 14</b>

Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than 137.2345.

Truncate your answer to  decimal places.

In [ ]:
SELECT ROUND(MAX(s.lat_n), 4)
FROM station as s
WHERE s.lat_n < 137.2345;

<b>Weather Observation Station 15</b>

Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than 1237.2345.

Round your answer to 4 decimal places.

In [ ]:
SELECT ROUND(MAX(s.long_w), 4)
FROM station as s
WHERE s.lat_n = (SELECT MAX(s.lat_n)
                 FROM station as s
                 WHERE s.lat_n < 137.2345);